ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_esm_regs.xml
<module id="HSM_ESM" HW_revision="" description="HSM ESM Registers">
	<register id="ESMIEPSR1" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="IEPSET" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMIEPCR1" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="IEPCLR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMIESR1" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="INTENSET" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMIECR1" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="INTENCLR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMILSR1" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="INTLVLSET" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMILCR1" width="32" page="0" offset="20" internal="0" description="">
		<bitfield id="INTLVLCLR" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMSR1" width="32" page="0" offset="24" internal="0" description="">
		<bitfield id="ESF" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMSR2" width="32" page="0" offset="28" internal="0" description="">
		<bitfield id="ESF" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMSR3" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="ESF" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESMEPSR" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="EPSF" description="" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="ESMIOFFHR" width="32" page="0" offset="40" internal="0" description="">
		<bitfield id="INTOFFH" description="" begin="8" end="0" width="9" rwaccess="R"/>
	</register>
	<register id="ESMIOFFLR" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="INTOFFL" description="" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="ESMLTCR" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="LTCP" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ESMLTCPR" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="LTCP" description="" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ESMEKR" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="EKEY" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="ESMSSR2" width="32" page="0" offset="60" internal="0" description="">
		<bitfield id="ESF" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
